In [1]:
import pandas as pd

In [ ]:
"""Tabular Data"""

In [3]:
employee_data_table={
    "EmployeeId":[1, 2, 3, 4, 5],
    "Name": ["John", "Ebrahim", "Hossain", "Smith", "Imran"],
    "Salary": [20000, 90000, 40000, 60000, 50000]
}

employee_df = pd.DataFrame(employee_data_table)
employee_df

   EmployeeId     Name  Salary
0           1     John   20000
1           2  Ebrahim   90000
2           3  Hossain   40000
3           4    Smith   60000
4           5    Imran   50000

In [4]:
"""Show first 3 values of table"""
employee_df.head(3)

   EmployeeId     Name  Salary
0           1     John   20000
1           2  Ebrahim   90000
2           3  Hossain   40000

In [5]:
"""Show last 5 values of table"""
employee_df.tail()

   EmployeeId     Name  Salary
0           1     John   20000
1           2  Ebrahim   90000
2           3  Hossain   40000
3           4    Smith   60000
4           5    Imran   50000

In [6]:
"""Show last 2 values of table"""
employee_df.tail(2)

   EmployeeId   Name  Salary
3           4  Smith   60000
4           5  Imran   50000

In [7]:
"""Shape of DataFrame"""
employee_df.shape

(5, 3)

In [8]:
"""Check Info of DataFrame"""
employee_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeId  5 non-null      int64
 1   Name        5 non-null      object
 2   Salary      5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [9]:
"""Describe of DataFrame"""
employee_df.describe()

       EmployeeId        Salary
count    5.000000      5.000000
mean     3.000000  52000.000000
std      1.581139  25884.358211
min      1.000000  20000.000000
25%      2.000000  40000.000000
50%      3.000000  50000.000000
75%      4.000000  60000.000000
max      5.000000  90000.000000

In [11]:
"""Vales of DataFrame"""
print(employee_df.values)

[[1 'John' 20000]
 [2 'Ebrahim' 90000]
 [3 'Hossain' 40000]
 [4 'Smith' 60000]
 [5 'Imran' 50000]]

In [10]:
"""Type of DataFrame"""
print(type(employee_df.values))

<class 'numpy.ndarray'>

In [16]:
"""Add Column to DataFrame"""
employee_df.columns = ["ID", "Name", "Salary"]
employee_df.head()

   ID     Name  Salary
0   1     John   20000
1   2  Ebrahim   90000
2   3  Hossain   40000
3   4    Smith   60000
4   5    Imran   50000

   ID     Name  Salary
0   1     John   20000
1   2  Ebrahim   90000
2   3  Hossain   40000
3   4    Smith   60000
4   5    Imran   50000